#define _CRT_SECURE_NO_WARNINGS

/* 刘志龙 */
/* 2025/4/17 */

/* C语言初阶 */
#include <stdio.h>

/* 调试技巧 */
// 开始调试
// f5
// 设置断点
// f9
// 逐语句调试
// f10
// 进入函数内部调试
// f11
// 调试窗口使用
// 一定是开始调试后才能打开调试窗口

// 调试案例
//// 1.计算 1! + 2! +3! +...+ n!
//int main() {
//	int i = 0;
//	int j = 0;
//	int n = 0;
//	scanf("%d", &n);
//	int ret = 1;
//	int sum = 0;
//	for (i = 1; i <= n; i++) {
//		// ret要重置
//		ret = 1;
//		for (j = 1; j <= i; j++) {
//			ret *= j;
//		}
//		sum += ret;
//	}
//	// 预期结果：9
//	printf("%d", sum);// 运行结果 15，与预期不符
//	// 经过调试发现，每次变量i改变时ret总是不变，在下一次使用时将上一次的结果乘了上去，导致结果偏大
//	return 0;
//}

//// 2.
//int main() {
//	int i = 0;
//	int arr[] = { 1,2,3,4,5,6,7,8,9,10 };
//	for (i = 0; i <= 12; i++) {
//		// 数组越界访问
//		arr[i] = 0;
//		printf("hehe\n");// 不断打印hehe
//		// 经过调试发现，当对arr[12]修改后i的值也发生变化
//	}
//	// 分析原因：
//	// i和arr都是局部变量，局部变量存放在栈区
//	// 栈区内存的使用习惯是：先使用高地址空间，再使用低地址
//	// 数组随着下标增长地址，是由低到高的
//	// 在vs编译器 - 2个整形
//	// 在gcc编译器 - 1个整形
//	// 在vc6.0编译器 - 0个整形
//	return 0;
//}