#define _CRT_SECURE_NO_WARNINGS

/* 刘志龙 */
/* 2025/4/14 */

/* C语言初阶 */
#include <stdio.h>


/* 操作符详解 */

//// 算数操作符
//int main() {
//	int a = 6 / 5;
//	printf("%d\n", a);// 1
//
//	double b = 6 / 5;
//	printf("%lf\n", b);// 1.0
//
//	double c = 6.0 / 5;// 小数除法，必须有一个数为浮点数
//	printf("%lf\n", c);// 1.2
//
//	int d = 6 % 5;// 取模运算必须是整形才可以
//	printf("%d", d);// 1
//	return 0;
//}

//// 移位操作符
//// 移位数是正整数
//// 整型在内存中是以二进制补码的形式存储的
//// 原码：一个数的32位二进制表示，正数最高位是0，负数是1
//// 反码：最高位不变，其它位按位取反
//// 补码：反码加1
//int main() {
//	// 左移操作符<<
//	int a = 1;
//	a <<= 2;// 将a的二进制位向左移动两位，超出部分清除，剩余部分补0
//	// 00000000000000000000000000000001
//	// 00000000000000000000000000000100
//	printf("%d\n", a);// 4
//
//	// 右移操作符>>
//	// 当前编译器采用算数右移：
//	// 当操作数是正数时最高位补0，当操作数是负数时最高位补1
//	int b = -1;
//	b >>= 2;
//	// 原码：10000000000000000000000000000001
//	// 反码：11111111111111111111111111111110
//	// 补码：11111111111111111111111111111111
//	// 右移：11111111111111111111111111111111
//	// 原码：10000000000000000000000000000001
//	printf("%d\n", b);//-1
//	return 0;
//}

//// 位操作符
////int main() {
////	int a = 3;
////	int b = 5;
////	// 按位与&
////	// 对应二进制位都是1时结果是1，否则结果是0
////	int c = a & b;
////	// 00000000000000000000000000000011
////	// 00000000000000000000000000000101
////	// 00000000000000000000000000000001
////	printf("%d\n", c);// 1
////
////	// 按位或|
////	// 对应二进制位只要有一个是1结果是1，否则结果时0
////	int d = a | b;
////	// 00000000000000000000000000000011
////	// 00000000000000000000000000000101
////	// 00000000000000000000000000000111
////	printf("%d\n", d);// 7
////
////	// 按位异或^
////	// 对应二进制位相同结果是0，不同结果是1
////	int e = a ^ b;
////	// 00000000000000000000000000000011
////	// 00000000000000000000000000000101
////	// 00000000000000000000000000000110
////	printf("%d\n", e);// 6
////	return 0;
////}
//int main() {
//	//// 不创建第三个变量交换两个数的值
//	//int a = 3;
//	//int b = 5;
//
//	////// 1.加减法
//	////printf("a = %d, b = %d\n", a, b);
//	////a = a + b;
//	////b = a - b;
//	////a = a - b;
//	////printf("a = %d, b = %d\n", a, b);
//
//	//// 2.按位异或
//	//printf("a = %d, b = %d\n", a, b);
//	//a = a ^ b;
//	//b = a ^ b;
//	//a = a ^ b;
//	//printf("a = %d, b = %d\n", a, b);
//
//	// 改变指定二进制位上的值
//	int a = 13;
//	// 00000000000000000000000000001101
//	// 将倒数第五位的值改为1
//	// 00000000000000000000000000011101
//	int b = 1 << 4;
//	// 00000000000000000000000000001101
//	// 00000000000000000000000000010000
//	// 00000000000000000000000000011101
//	a = a | b;
//	printf("%d\n", a);// 29
//	// 将他改回0
//	int c = ~(1 << 4);
//	// 00000000000000000000000000011101
//	// 11111111111111111111111111101111
//	// 00000000000000000000000000001101
//	a = a & c;
//	printf("%d\n", a);// 13
//
//	return 0;
//}

// 赋值操作符
// = 
// 适用于与自己进行相关运算：+= -= *= /= %= &=  |= ^= <<= >>=

//// 单目操作符
//int main() {
//	//// 逻辑反操作!
//	//int a = 0;
//	//if (a) {
//	//	printf("hehe\n");
//	//}
//	//if (!a) {
//	//	printf("haha\n");
//	//}
//
//	//// sizeof操作数的类型长度（单位字节）
//	//int a = 0;
//	//int arr[10] = { 0 };
//	//printf("%d\n", sizeof(a));// 4
//	//printf("%d\n", sizeof(int));// 4
//	//printf("%d\n", sizeof(arr));// 40
//	//printf("%d\n", sizeof(int [10]));// 40
//	//short s = 5;
//	//int b = 10;
//	//printf("%d\n", sizeof(s = b + 2));// 2
//	//// sizeof内的计算在编译之前，不会计算出结果
//	//printf("%d\n", s);// 5
//
//	//// ++ --操作符
//	//int a = 10;
//	//int b = a++;// 先使用再加1
//	//printf("%d\n", a);// 11
//	//printf("%d\n", b);// 10
//	//int c = ++a;// 先加1再使用
//	//printf("%d\n", a);// 12
//	//printf("%d\n", c);// 12
//
//	// (类型)强制类型转换操作符
//  int a = (int)3.14
//  printf("%d", a);// 3
//
//	return 0;
//}
//int main() {
//	int a = 10;
//	printf("%p", &a);// & - 取地址操作符
//	int* pa = &a;// pa用来存放a的地址 - pa是一个指针变量
//	*pa = 20;// * - 解引用操作符 - 间接访问操作符
//	printf("%d", a);// 20
//
//	return 0;
//}

// 关系操作符
// == 判断左右真值是否相等，注意与'='区分
// 比较两个字符串长度不能用==
// > < >= <= 

//// 逻辑操作符 && ||
//// && - 逻辑与
//// 判断左右真值，都为真则结果为真，否则结果为假
//// || - 逻辑或
//// 判断左右真值，有一个为真结果为真，否则结果为假
//int main() {
//	// 当一个语句中出现多个&&时，语句执行到有一个表达式真值为假时停止执行
//	// 当一个语句中出现多个||时，语句执行到有一个表达式真值为真时停止执行
//
//	int i = 0, a = 0, b = 2, c = 3, d = 4;
//	i = a++ && ++b && d++;// 当执行到第一个表达式时，真值为假停止执行
//	printf("%d %d %d %d\n", a, b, c, d);// 1 2 3 4
//
//	i = a++ || ++b || d++;// 当执行到第二个表达式时，真值为真停止执行
//	printf("%d %d %d %d\n", a, b, c, d);// 2 2 3 4
//	return 0;
//}

//// 条件操作符（三目操作符）
//// (表达式一)?(表达式二):(表达式三);
//// 表达式一结果为真时执行表达式二，否则执行表达式三
//int main() {
//	int a = 5;
//	int b = 10;
//	//if (a > b) {
//	//	printf("haha");
//	//}
//	//else {
//	//	printf("hehe");
//	//}
//
//	(a > b) ? (printf("haha")) : (printf("hehe"));
//	return 0;
//}

// 逗号表达式
// (表达式一),(表达式二),(表达式三),...,(表达式n)
// 从左往右依次执行，计算结果为最后一个表达式的结果
int main() {
	int a = 10;
	int b = 5;
	int c = 8;
	int d = ((a += 5), (b = a - c), (c = a + b - 3));
	printf("%d %d %d %d\n", a, b, c, d);// 15 7 19 19

	//// 简化表达
	//// a = get_val();
	//// count_val(a)
	//// while (a) {
	////		//业务处理
	////		a = get_val();
	////		count_val(a);
	//// }
	//// 用逗号表达式改写
	//// while (a = get_val(), count_val(a), a > 0) {
	////		// 业务处理
	//// }
	return 0;
}